unixorn/fzf-zsh-plugin
Aloxaf/fzf-tab
zsh-users/zsh-history-substring-search
zsh-users/zsh-autosuggestions
ajeetdsouza/zoxide
mollifier/cd-gitroot
z-shell/zsh-eza
https://iterm2.com/shell_integration/zsh
hlissner/zsh-autopair
zdharma-continuum/fast-syntax-highlighting
